src/cf/src/Tasks/ЗадачиПользователя/ЗадачиПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>ЗадачиПользователя</name>
  <comment>Service Desk</comment>
  <basedOn>Catalog.РабочиеМеста</basedOn>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗадачи</name>
    <type>
      <types>CatalogRef.ВидыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийИдентификатор</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнешняяСсылка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаИсполнителейЗадач</name>
    <type>
      <types>CatalogRef.ГруппыИсполнителейЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <comment>Дата начала выполнения задачи - для приоритезации исполнителем своих задач</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОценкиЗадачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятияКИсполнению</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КонфигурационнаяЕдиница</name>
    <type>
      <types>CatalogRef.КонфигурационныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Оповещение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>TaskRef.ЗадачиПользователя</types>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокТрудозатрат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокТрудозатратДляПриоритизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтмененаЗадача</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаЗадачи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПамятнаяДата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательУслуг</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринятаКИсполнению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентЗавершения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентЗавершенияДляПриоритизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочаяГруппаСтрока</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполненияСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокОповещения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.ТипыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПользователей</name>
    <comment>В качестве типа используется пустая ссылка</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Трудоемкость</name>
    <type>
      <types>DefinedType.ТрудоемкостьЧасовНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыНаОценку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПланНаСпринт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПлановые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПредварительные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УзелОбмена</name>
    <comment>Идентификатор узла обмена распределенной базы данных плана обмена &quot;ОбменВРаспределеннойИнформационнойБазе&quot;</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РабочаяГруппа</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.ВнешниеПользователи</types>
        <types>CatalogRef.ГруппыВнешнихПользователей</types>
        <types>CatalogRef.ГруппыПользователей</types>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>ТипРаботы</name>
      <type>
        <types>EnumRef.ТипыРаботПоЗадачам</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрудозатратыПлановые</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выполнена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <addressingAttributes>
    <name>ДополнительныйОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>ОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>РольИсполнителя</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

src/cf/src/InformationRegisters/ЗатраченноеВремяПоЗадачам/ЗатраченноеВремяПоЗадачам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗатраченноеВремяПоЗадачам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ЗатраченноеВремя</name>
    <type>
      <types>DefinedType.ТрудоемкостьЧасовНеотрицательная</types>
    </type>
  </resources>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторФиксацииВремени</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтразитьРаботуПоЗадаче</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботаПоЗадаче</name>
    <type>
      <types>DocumentRef.РаботыПоЗадаче</types>
    </type>
  </attributes>
  <dimensions>
    <name>Задача</name>
    <comment>АПК:1208 Считаем корректным имя в Купорос</comment>
    <type>
      <types>TaskRef.ЗадачиПользователя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРаботы</name>
    <type>
      <types>CatalogRef.ВидыРабот</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ИсторияСобытийЗадач/ИсторияСобытийЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияСобытийЗадач</name>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Задача</name>
    <comment>АПК:1208 Считаем корректным имя в Купорос</comment>
    <type>
      <types>TaskRef.ЗадачиПользователя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>EnumRef.ВидыСобытийЗадач</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Enums/ВидыСобытийЗадач/ВидыСобытийЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСобытийЗадач</name>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>ИзмененаВажность</name>
  </enumValues>
  <enumValues>
    <name>ИзмененСрок</name>
  </enumValues>
  <enumValues>
    <name>ОткрытаКарточка</name>
  </enumValues>
  <enumValues>
    <name>ОтправленоУведомление</name>
  </enumValues>
  <enumValues>
    <name>Перенаправлена</name>
  </enumValues>
  <enumValues>
    <name>ПринятаКИсполнению</name>
  </enumValues>
  <enumValues>
    <name>ПринятиеКИсполнениюОтменено</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>ОтветИсполнителя</name>
  </enumValues>
  <enumValues>
    <name>ИзмененПроцентЗавершения</name>
  </enumValues>
  <enumValues>
    <name>ДополнениеОписания</name>
  </enumValues>
  <enumValues>
    <name>ВозвратКИсполнению</name>
  </enumValues>
  <enumValues>
    <name>ОценкаВыполнения</name>
  </enumValues>
  <enumValues>
    <name>ЗарегистрированоПоЭлектроннойПочте</name>
  </enumValues>
  <enumValues>
    <name>ИзмененоСостояниеДругое</name>
  </enumValues>
  <enumValues>
    <name>ИзмененПолучательУслуг</name>
  </enumValues>
  <enumValues>
    <name>ИзмененВидЗадачи</name>
  </enumValues>
  <enumValues>
    <name>ЗарегистрированоПоТелеграм</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Documents/РаботыПоЗадаче/РаботыПоЗадаче.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РаботыПоЗадаче</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСОрганизациями</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Задача</name>
    <comment>АПК:1208 Считаем корректным имя в Купорос</comment>
    <type>
      <types>TaskRef.ЗадачиПользователя</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяТрудоемкость</name>
    <type>
      <types>DefinedType.ТрудоемкостьЧасовНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>РучноеДобавление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

src/cf/src/Tasks/ЗадачиПользователя/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		УзелОбмена = ОбщегоНазначенияКупоросСервер.ЭтотУзелОбменаДляКупорос();
	КонецЕсли;
	
	Если Не Выполнена Тогда
		
		ДатаВыполнения = '00010101';
		
	Иначе
		
		// При факте выполнения задачи процент завершения 100% и задача принята к исполнению.
		ПроцентЗавершения = 100;
		ПринятаКИсполнению = Истина;
		
		Если Не ЗначениеЗаполнено(ДатаВыполнения) Тогда
			
			ДатаВыполнения = ТекущаяДатаСеанса();
			
		КонецЕсли;
		
	КонецЕсли;

	Если ЗначениеЗаполнено(ТрудозатратыПлановые) Тогда
		
		ОстатокТрудозатрат = ТрудозатратыПлановые * (100 - ПроцентЗавершения) / 100;
		
	Иначе
		
		ОстатокТрудозатрат = ТрудозатратыНаОценку  + ТрудозатратыПредварительные;
		
	КонецЕсли;
	
	Если ПриоритетВыполнения = 0 Тогда
		
		ПриоритетВыполнения = 3;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СрокОповещения)
		Или Выполнена Тогда
		Оповещение = Ложь;
	КонецЕсли;

	Если ОтмененаЗадача 
		И Не Выполнена Тогда
		ОтмененаЗадача = Ложь;
	КонецЕсли;
	
	Дата = ТекущаяДата();
	Если ДатаНачала = '00010101' Тогда
		 ДатаНачала = Дата;
	КонецЕсли;
	
	ПользовательРедактировавший = Пользователи.ТекущийПользователь();
	СрокИсполненияСтрока = Формат(СрокИсполнения, "ДФ=dd.MM.yyyy");
	
	// Получение новой ссылки для новой задачи.
	СсылкаНаЗадачу = ОбщегоНазначенияКупоросСервер.СсылкаНаНезаписанныйОбъект(ЭтотОбъект, Ссылка);	
	
	// Фиксация истории событий задач.
	Если Ссылка.Выполнена <> Выполнена 
		И Выполнена = Истина Тогда
		
		Комментарий = СтрШаблон(НСтр("ru = 'Исполнитель: %1'"), Строка(ПользовательРедактировавший));
		ИсторияСобытийЗадачВызовСервера.ЗаписатьСобытие(
			Ссылка, 
			Перечисления.ВидыСобытийЗадач.Выполнена, 
			Комментарий);
		
	КонецЕсли;	
	
	Если Ссылка.Выполнена <> Выполнена 
		И Выполнена = Ложь Тогда
		
		Комментарий = СтрШаблон(НСтр("ru = 'Возвратил к исполнению: %1'"), Строка(ПользовательРедактировавший));
		ИсторияСобытийЗадачВызовСервера.ЗаписатьСобытие(
			Ссылка, 
			Перечисления.ВидыСобытийЗадач.ВозвратКИсполнению, 
			Комментарий);
		
	КонецЕсли;	
		
	Если Не Выполнена 
		И (Не Ссылка.Пустая()) Тогда
		
		Если Ссылка.ПроцентЗавершения <> ПроцентЗавершения 
			И ПроцентЗавершения > 0 Тогда
			// Принимать к исполнению задачу, если изменен процент выполнения.
			ПринятаКИсполнению = Истина;
		КонецЕсли;
		
		Если Ссылка.ПринятаКИсполнению <> ПринятаКИсполнению 
			И (Не Ссылка.Выполнена) 
			И (Не Ссылка.ОтмененаЗадача) Тогда
			
			Если ПринятаКИсполнению Тогда
				ИсторияСобытийЗадачВызовСервера.ЗаписатьСобытие(Ссылка, Перечисления.ВидыСобытийЗадач.ПринятаКИсполнению);
			Иначе
				ИсторияСобытийЗадачВызовСервера.ЗаписатьСобытие(Ссылка, Перечисления.ВидыСобытийЗадач.ПринятиеКИсполнениюОтменено);
			КонецЕсли;			
			
		КонецЕсли;
		
		Если Ссылка.Исполнитель <> Исполнитель Тогда
			
			БылИсполнитель = Ссылка.Исполнитель;
			
			СталИсполнитель = Исполнитель;
			Если СталИсполнитель.Пустая() Тогда
				СталИсполнитель = РольИсполнителя;
			КонецЕсли;	
			
			Комментарий = СтрШаблон(НСтр("ru = 'От исполнителя %1 к исполнителю %2'"),БылИсполнитель, СталИсполнитель);
			ИсторияСобытийЗадачВызовСервера.ЗаписатьСобытие(
				Ссылка, 
				Перечисления.ВидыСобытийЗадач.Перенаправлена,
				Комментарий);
				
		КонецЕсли;
		
		Если Ссылка.ПолучательУслуг <> ПолучательУслуг Тогда
			
			БылПолучательУслуг = Ссылка.ПолучательУслуг;
			
			СталПолучательУслуг = ПолучательУслуг;
			
			Комментарий = СтрШаблон(НСтр("ru = 'От получателя услуг %1 к %2'"), БылПолучательУслуг, СталПолучательУслуг);
			ИсторияСобытийЗадачВызовСервера.ЗаписатьСобытие(
				Ссылка, 
				Перечисления.ВидыСобытийЗадач.ИзмененПолучательУслуг,
				Комментарий);
				
		КонецЕсли;
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗадач")
			И Ссылка.ВидЗадачи <> ВидЗадачи Тогда
			
			БылВидЗадачи = Ссылка.ВидЗадачи;
			
			СталВидЗадачи = ВидЗадачи;
			
			Комментарий = СтрШаблон(НСтр("ru = 'Был %1, стал %2'"), БылВидЗадачи, СталВидЗадачи);
			ИсторияСобытийЗадачВызовСервера.ЗаписатьСобытие(
				Ссылка, 
				Перечисления.ВидыСобытийЗадач.ИзмененВидЗадачи,
				Комментарий);
				
		КонецЕсли;
		
		
		Если Ссылка.СрокИсполнения <> СрокИсполнения Тогда
			
			Комментарий = СтрШаблон(НСтр("ru = 'Был %1, стал %2'"),Строка(Ссылка.СрокИсполнения),Строка(СрокИсполнения));
			ИсторияСобытийЗадачВызовСервера.ЗаписатьСобытие(
				Ссылка, 
				Перечисления.ВидыСобытийЗадач.ИзмененСрок,
				Комментарий);
				
		КонецЕсли;
		
		Если Ссылка.Важность <> Важность Тогда
			
			Комментарий = СтрШаблон(НСтр("ru = 'Была %1, стала %2'"),Строка(Ссылка.Важность),Строка(Важность));
			ИсторияСобытийЗадачВызовСервера.ЗаписатьСобытие(
				Ссылка, 
				Перечисления.ВидыСобытийЗадач.ИзмененаВажность,
				Комментарий);
			
		КонецЕсли;
		
		Если Ссылка.ПроцентЗавершения <> ПроцентЗавершения 
			И (Не Ссылка.Выполнена) Тогда
			
			Комментарий = СтрШаблон(НСтр("ru = 'Было %1, стало %2'"), Строка(Ссылка.ПроцентЗавершения)+"%", Строка(ПроцентЗавершения)+"%");
			ИсторияСобытийЗадачВызовСервера.ЗаписатьСобытие(
				Ссылка, 
				Перечисления.ВидыСобытийЗадач.ИзмененПроцентЗавершения,
				Комментарий);
			
		КонецЕсли;
		
	КонецЕсли;	//Не Выполнена и (Не Ссылка.Пустая())
	
	Если Ссылка.Ответ <> Ответ Тогда
		
		Комментарий = СтрШаблон(НСтр("ru = 'Ответил: %1'"), Строка(ПользовательРедактировавший));
		Комментарий = Комментарий + Символы.ПС + Ответ;
		ИсторияСобытийЗадачВызовСервера.ЗаписатьСобытие(
			Ссылка, 
			Перечисления.ВидыСобытийЗадач.ОтветИсполнителя, 
			Комментарий);
			
	КонецЕсли;	

	Если ПользовательРедактировавший <> Исполнитель 
		И Ссылка.Описание <> Описание 
		И ТребуетсяДополнениеОписанияВИсторииЗадач(ПользовательРедактировавший)
		Тогда
		
		Комментарий = СтрШаблон(НСтр("ru = 'Дополнено описание: %1'"), Строка(ПользовательРедактировавший));
		ИсторияСобытийЗадачВызовСервера.ЗаписатьСобытие(
			Ссылка, 
			Перечисления.ВидыСобытийЗадач.ДополнениеОписания, 
			Комментарий);
			
	КонецЕсли;	
	
	// Удаление пустых строк рабочей группы.
	КолСтрокИсходное = РабочаяГруппа.Количество();
	индекс = 1; сч = 0;
	Пока индекс <= КолСтрокИсходное Цикл
		Если Не ЗначениеЗаполнено(РабочаяГруппа[сч].Пользователь) Тогда
			РабочаяГруппа.Удалить(РабочаяГруппа[сч]);    
		Иначе
			сч = сч + 1;    
		КонецЕсли;
		индекс = индекс + 1;
	КонецЦикла;
	
	// Обновление строки рабочей группы.
	РабочаяГруппаСтрока=""; сч=0;
	Для Каждого ТекСтрокаРабочейГруппы Из РабочаяГруппа Цикл
		
		сч=сч+1;
		 Если ЗначениеЗаполнено(ТекСтрокаРабочейГруппы.Пользователь) Тогда
		 	 РабочаяГруппаСтрока = РабочаяГруппаСтрока + ТекСтрокаРабочейГруппы.Пользователь + ?(сч=РабочаяГруппа.Количество(),"","; "); 
		 КонецЕсли;
		 
	КонецЦикла;
	
	Если Выполнена 
		И Не ПринятаКИсполнению Тогда
		
		ПринятаКИсполнению = Истина;
		ДатаПринятияКИсполнению = ТекущаяДатаСеанса();
		
	КонецЕсли;	
	
	// Заполнение реквизита ДатаПринятияКИсполнению.
	Если ПринятаКИсполнению 
		И ДатаПринятияКИсполнению = Дата('00010101') Тогда
		
		ДатаПринятияКИсполнению = ТекущаяДатаСеанса();
		
	КонецЕсли;
	
	// Фиксация затраченного времени выполненной задачи.
	Если Выполнена = Истина Тогда
		
		ДанныеПоЗатраченномуВремени = РегистрыСведений.ЗатраченноеВремяПоЗадачам.ФактическоеЗатраченноеВремяПоЗадаче(Ссылка);
		ЗатраченноеВремяПоЗадачеФакт = ДанныеПоЗатраченномуВремени.ОбщееЗатраченноеВремя;
		
		Если ЗатраченноеВремяПоЗадачеФакт = 0 
			И Трудоемкость > 0 Тогда
			
			// В случае если затраченное время по задаче не заполнено, текущую трудоемкость помещать в затраченное время факта.
			МенеджерЗаписи = РегистрыСведений.ЗатраченноеВремяПоЗадачам.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = ДатаВыполнения;
			МенеджерЗаписи.Задача = СсылкаНаЗадачу;
			МенеджерЗаписи.Исполнитель = Исполнитель;
			МенеджерЗаписи.ВидРаботы = Справочники.ВидыРабот.РаботаПоЗадаче;  // общий вид работы по задаче
			МенеджерЗаписи.ЗатраченноеВремя = Трудоемкость;
			МенеджерЗаписи.АвторФиксацииВремени = ПользовательРедактировавший;
			МенеджерЗаписи.Записать(Истина);
			
			ДанныеПоЗатраченномуВремени.ВремяИсполнителей.Вставить(Исполнитель, Трудоемкость);
			ДанныеПоЗатраченномуВремени.ОбщееЗатраченноеВремя = Трудоемкость;
			
		Иначе
			
			Трудоемкость = ЗатраченноеВремяПоЗадачеФакт;
			
		КонецЕсли;
		
		// фиксация работ по задаче по факту выполнения
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Проект, "ВестиУчетАктовВыполненныхРабот") = Истина 
			И Не ОтмененаЗадача
			И Трудоемкость > 0 Тогда
		
			Для каждого ТекСтрокаИсполнителей Из ДанныеПоЗатраченномуВремени.ВремяИсполнителей Цикл
				
				ДанныеДляФиксацииРабот = Новый Структура;
				ДанныеДляФиксацииРабот.Вставить("Дата", ДатаВыполнения);
				ДанныеДляФиксацииРабот.Вставить("Задача", СсылкаНаЗадачу);
				ДанныеДляФиксацииРабот.Вставить("Исполнитель", ТекСтрокаИсполнителей.Ключ);
				ДанныеДляФиксацииРабот.Вставить("ФактическаяТрудоемкость", ТекСтрокаИсполнителей.Значение);
				Документы.РаботыПоЗадаче.ЗафиксироватьРаботуПоЗадаче(ДанныеДляФиксацииРабот);
			
			КонецЦикла;
		
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = Исполнитель;
	КонецЕсли;
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УстановитьПривилегированныйРежим(Истина);
	ЗаполнитьОбъектыАдресацииНаОснованииОбъекта();
	ГруппаИсполнителейЗадач = БизнесПроцессыИЗадачиСервер.ГруппаИсполнителейЗадач(РольИсполнителя, ОсновнойОбъектАдресации, ДополнительныйОбъектАдресации);
	УстановитьПривилегированныйРежим(Ложь);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.РабочиеМеста") Тогда
		
		Исполнитель = Пользователи.ТекущийПользователь();
		Инициатор   = ДанныеЗаполнения.Ссылка;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДатаВыполнения = "";	
	Выполнена = Ложь;
	ОтмененаЗадача = Ложь;
	ПроцентЗавершения = 0;
	ОценкаЗадачи = 0;
	ДатаОценкиЗадачи = '00010101';
	Ответ = "";
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.УправлениеДоступом

// Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) создается прикладным разработчиком
//  в модулях объектов, тип которых задан в одной из подписок на событие.
//  ЗаписатьНаборыЗначенийДоступа или ЗаписатьЗависимыеНаборыЗначенийДоступа.
//  В процедуре выполняется заполнение наборов значений доступа по свойствам объекта.
//  
// Параметры:
//  Таблица - ТаблицаЗначений - возвращаемая функцией ТаблицаНаборыЗначенийДоступа.
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения для
	// - чтения:    Автор ИЛИ Исполнитель (с учетом адресации) ИЛИ Проверяющий (с учетом адресации)
	// - изменения: Автор.
	
	// Чтение, Изменение: набор № 1.1
	Строка = Таблица.Добавить();
	Строка.НомерНабора     = 1;
	Строка.Чтение          = Истина;
	Строка.Изменение       = Истина;
	Строка.ЗначениеДоступа = Инициатор;
	
	// Чтение, Изменение: набор № 1.2
	Строка = Таблица.Добавить();
	Строка.НомерНабора     = 1;
	Строка.Чтение          = Истина;
	Строка.Изменение       = Истина;
	Строка.ЗначениеДоступа = ПолучательУслуг;
	
	// Чтение, Изменение: набор № 2.
	Строка = Таблица.Добавить();
	Строка.НомерНабора     = 2;
	Строка.Чтение          = Истина;
	Строка.Изменение       = Истина;
	Строка.ЗначениеДоступа = ГруппаИсполнителейЗадач;
	
	// Чтение, Изменение: набор № 3.
	Если ЗначениеЗаполнено(Исполнитель) Тогда
		Строка = Таблица.Добавить();
		Строка.НомерНабора     = 3;
		Строка.Чтение          = Истина;
		Строка.Изменение       = Истина;
		Строка.ЗначениеДоступа = Исполнитель;
	КонецЕсли;
	
	// Чтение: набор № 4.
	НомерНабораРабочейГруппы = 4;
	Для каждого ТекРабочаяГруппа Из РабочаяГруппа Цикл
		Строка = Таблица.Добавить();
		Строка.НомерНабора     = НомерНабораРабочейГруппы;
		Строка.Чтение          = Истина;
		Строка.Изменение       = Ложь;
		Строка.ЗначениеДоступа = ТекРабочаяГруппа.Пользователь;
		НомерНабораРабочейГруппы = НомерНабораРабочейГруппы + 1;
	КонецЦикла;	
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

//////////////////////////////////////////////////////////////////////////////////////////
// ПРОЧИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ТребуетсяДополнениеОписанияВИсторииЗадач(ПользовательРедактировавший) 
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		// новые задачи нет необходимости в фиксации дополнения описания
		Возврат Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДатаУведомленияОНовыхЗадачах = Константы.ДатаУведомленияОНовыхЗадачах.Получить();
	Если ДатаНачала > ДатаУведомленияОНовыхЗадачах Тогда
		// Если задача создана в текущий период от даты уведомления, то нет необходимости в фиксации дополнения описания.
		// В случае если регламентное задание уведомлений не используется, то дополнение описания также не фиксируется.
		Возврат Ложь;
	КонецЕсли;
	
	// Проверка на наличие ранее введенного дополнения описания за текущий период уведомления.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ИсторияСобытийЗадач.Задача,
	|	ИсторияСобытийЗадач.ДатаСобытия,
	|	ИсторияСобытийЗадач.Пользователь,
	|	ИсторияСобытийЗадач.Событие
	|ИЗ
	|	РегистрСведений.ИсторияСобытийЗадач КАК ИсторияСобытийЗадач
	|ГДЕ
	|	ИсторияСобытийЗадач.Задача = &Задача
	|	И ИсторияСобытийЗадач.ДатаСобытия >= &ДатаСобытия
	|	И ИсторияСобытийЗадач.Пользователь = &Пользователь
	|	И ИсторияСобытийЗадач.Событие = Значение(Перечисление.ВидыСобытийЗадач.ДополнениеОписания)";
	
	Запрос.УстановитьПараметр("Задача", Ссылка);
	Запрос.УстановитьПараметр("Пользователь", ПользовательРедактировавший);
	Запрос.УстановитьПараметр("ДатаСобытия", ДатаУведомленияОНовыхЗадачах);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Возврат Выборка.Количество()=0; 	
	
КонецФункции

// Заполнение из данных задачи объектов ролевой адресации: Проект
//
Процедура ЗаполнитьОбъектыАдресацииНаОснованииОбъекта()
	
	Если Не ЗначениеЗаполнено(РольИсполнителя) Тогда
		Возврат;	
	КонецЕсли;
	
	Если Не РольИсполнителя.ИспользуетсяСОбъектамиАдресации Тогда
		Возврат;
	КонецЕсли;
	
	// Заполнение проекта
	Если РольИсполнителя.ТипыОсновногоОбъектаАдресации=ПланыВидовХарактеристик.ОбъектыАдресацииЗадач.Проект 
		И ЗначениеЗаполнено(Проект) Тогда
		ОсновнойОбъектАдресации = Проект;
	КонецЕсли;
	Если РольИсполнителя.ТипыДополнительногоОбъектаАдресации=ПланыВидовХарактеристик.ОбъектыАдресацииЗадач.Проект 
		И ЗначениеЗаполнено(Проект) Тогда
		ДополнительныйОбъектАдресации = Проект;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
